This data consist the list of countries by external debt it is the total public and private debt owed to nonresidents repayable in internationally accepted currencies, goods or services, where the public debt is the money or credit owed by any level of government, from central to local, and the private debt the money or credit owed by private households or private corporations based on the country under consideration.

For information purposes, several non-sovereign entities are also included in this list.

Note that while a country may have a relatively large external debt (either in absolute or per capita terms) it could actually be a "net international creditor" if its external debt is less than the total of external debt of other countries held by it.

In [1]:
import pandas as pd
import requests
from bs4 import BeautifulSoup
import warnings
warnings.filterwarnings('ignore')

### URL of the Wikipedia page

In [135]:
url = 'https://en.wikipedia.org/wiki/List_of_countries_by_external_debt'

### Send a GET request to the URL

In [138]:
response = requests.get(url)

### Parse the page content

In [140]:
soup = BeautifulSoup(response.content, 'html.parser')

### Find the table on the page

In [144]:
table = soup.find('table', {'class': 'wikitable'})

### Use pandas to read the HTML table into a DataFrame

In [147]:
data = pd.read_html(str(table))[0]

In [148]:
data.tail()

           Country or territory               External debt (USD)  \
           Country or territory Per capita[1][circular reference]
206               Anguilla (UK)                             553.0
207  Wallis and Futuna (France)                             319.0
208             Montserrat (UK)                             237.0
209               Liechtenstein                               0.0
210          Niue (New Zealand)                               0.0

                                                                        \
            Total % of GDP[2][circular reference] % of total wealth[3]
206   8.8 million                             5.0                  NaN
207  3.67 million                             6.0                  NaN
208  1.04 million                             2.0                  NaN
209             0                             0.0                  NaN
210             0                             0.0                  NaN

                      Date
                      Date
206               1998[99]
207              2004[100]
208  31 December 2011[101]
209              2001[102]
210   27 October 2016[103]

In [149]:
data.columns = ['Country or territory', 'Per capita', 'Total', '% of GDP', '% of total wealth', 'Date']

In [153]:
data.head()

,Country or territory,Per capita,Total,% of GDP,% of total wealth,Date
0,United States of America,76426.0,35 trillion,123.00,17.66,December 2023[4][5]
1,European Union,38855.0,17.4 trillion,97.78,16.69,Dec 2023[4]
2,United Kingdom,142455.0,9.65 trillion,276.07,60.41,Dec 2023[4]
3,France,118148.0,7.65 trillion,244.44,48.65,Dec 2023[4]
4,Germany,81134.0,6.76 trillion,147.20,38.78,Dec 2023[4]

### changed the date column format

In [156]:
data['Date'] = pd.to_datetime(data['Date'].str.extract(r'(\w+ \d{4}|\d{4})')[0], errors='coerce')

In [158]:
data['Year'] = data['Date'].dt.year
data['Month'] = data['Date'].dt.month_name()

### multiply call all the values in Total column by trillion figures

In [187]:
data.tail(10)

,Country or territory,Per capita,Total,% of GDP,% of total wealth,Date,Year,Month
201,Greenland (Denmark),643.0,36.4 million,1.24,NaN,2010-01-01,2010,January
202,Nauru,2606.0,33.3 million,20.68,NaN,2004-01-01,2004,January
203,British Virgin Islands (UK),560.0,17.7 million,2.00,NaN,2016-12-01,2016,December
204,Tuvalu,1299.0,14.8 million,22.42,NaN,2017-01-01,2017,January
205,Kiribati,102.0,13.6 million,4.37,NaN,2013-01-01,2013,January
206,Anguilla (UK),553.0,8.8 million,5.00,NaN,1998-01-01,1998,January
207,Wallis and Futuna (France),319.0,3.67 million,6.00,NaN,2004-01-01,2004,January
208,Montserrat (UK),237.0,1.04 million,2.00,NaN,2011-12-01,2011,December
209,Liechtenstein,0.0,0,0.00,NaN,2001-01-01,2001,January
210,Niue (New Zealand),0.0,0,0.00,NaN,2016-10-01,2016,October

In [175]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 211 entries, 0 to 210
Data columns (total 8 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Country or territory  211 non-null    object
 1   Per capita            211 non-null    float64
 2   Total                 211 non-null    object
 3   % of GDP              211 non-null    float64
 4   % of total wealth     159 non-null    float64
 5   Date                  211 non-null    datetime64[ns]
 6   Year                  211 non-null    int32
 7   Month                 211 non-null    object
dtypes: datetime64[ns](1), float64(3), int32(1), object(3)
memory usage: 12.5+ KB

In [177]:
data.describe()

,Per capita,% of GDP,% of total wealth,Date,Year
count,2.110000e+02,211.000000,159.000000,211,211.000000
mean,5.773482e+04,121.278483,44.891950,2019-07-21 22:44:55.734597120,2018.943128
min,0.000000e+00,0.000000,0.210000,1998-01-01 00:00:00,1998.000000
25%,5.565000e+02,18.160000,12.735000,2016-12-01 00:00:00,2016.000000
50%,2.351000e+03,38.790000,21.020000,2021-01-01 00:00:00,2021.000000
75%,1.353450e+04,73.400000,40.450000,2023-12-01 00:00:00,2023.000000
max,5.790000e+06,5968.000000,1267.430000,2024-07-01 00:00:00,2024.000000
std,4.091621e+05,514.339686,112.299353,NaN,5.059323

### importing some libriares to move the data to MYSQL

In [179]:
import pyodbc
import sqlalchemy

In [180]:
engine = sqlalchemy.create_engine(r'mssql://DESKTOP-KFUGVTE\SQLEXPRESS10/Project?driver=ODBC+DRIVER+17+FOR+SQL+SERVER')
conn = engine.connect()

In [182]:
data.to_sql(name='External_debt', con=conn, index=False, if_exists='replace')

211

In [185]:
number_of_rows = len(data)
print("Number of rows:", number_of_rows)

Number of rows: 211